app/controllers/question_controller.rb

  def index_col
    @questions = Question.all #where(user.type == 1-5)に書き換える
---
SELECT "questions".* FROM "questions"