app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "grade") VALUES (?, ?, ?, ?, ?, ?)  [["name", "t"], ["email", "t"], ["password", "t"], ["created_at", "2017-10-27 10:06:13.179104"], ["updated_at", "2017-10-27 10:06:13.179104"], ["grade", 0]]
---
    def create
      @user = User.new(user_params)

      respond_to do |format|
        if @user.save